{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 10], "dtype": "int32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"input_dim": 80000, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "batch_input_shape": [null, 10], "output_dim": 100, "dtype": "int32", "input_length": 10, "name": "embedding_1", "embeddings_constraint": null, "activity_regularizer": null, "trainable": false, "embeddings_regularizer": null}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_constraint": null, "activation": "relu", "units": 128, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "bias_constraint": null, "activation": "softmax", "units": 3, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.0.5", "backend": "tensorflow"}