{"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "dtype": "int32", "name": "input_1", "batch_input_shape": [null, 10]}}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1", "config": {"embeddings_constraint": null, "dtype": "int32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 10, "input_dim": 80000, "name": "embedding_1", "embeddings_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 10], "mask_zero": false, "output_dim": 100, "trainable": false}}, {"class_name": "Dense", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "dense_1", "config": {"bias_constraint": null, "use_bias": true, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "units": 128, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}, {"class_name": "Flatten", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_2", "config": {"bias_constraint": null, "use_bias": true, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "units": 2, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.5", "backend": "tensorflow"}